### Pandas to clean data
### pandas to create Series and Dataframe
### series, dataframe, they have index(rows) and columns
### loc (access rows using explicit index, iloc (access rows using implicit index)
### missing values

-combining datasets
-aggregation (groupby)

###combining datasets
-combine multiple datasets into one
-concat
-append
-merge

In [3]:
import pandas as pd
ser1 = pd.Series (["A", "B", "C"], index = [1,2,3])
ser2 = pd.Series (["D", "E", "F"], index = [4,5,6])
ser1

1    A
2    B
3    C
dtype: object

In [4]:
ser2

4    D
5    E
6    F
dtype: object

In [5]:
pd.concat([ser1, ser2]) #combined

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [8]:
ser2 = pd.Series (["D", "E", "F"], index = [1,2,3])
ser3 = pd.concat([ser1,ser2])
ser3

1    A
2    B
3    C
1    D
2    E
3    F
dtype: object

In [9]:
ser3.loc[1]

1    A
1    D
dtype: object

In [11]:
import numpy as np

df5 = pd.DataFrame(np.random.randint(0,11, size=(2,3)), columns=["A","B","C"],
                  index=[1,2])

In [12]:
df5

   A  B  C
1  2  0  0
2  1  9  9

In [15]:
df5["B"] #this is a series #dataframe is putting multiple series together #every column in a dataframe is a series

1    0
2    9
Name: B, dtype: int64

In [17]:
df6 = pd.DataFrame(np.random.randint(0,11, size=(2,3)), columns=["D","B","C"],
                  index=[3,4])
df6

   D  B  C
3  8  0  9
4  8  7  4

In [19]:
df7 = pd.concat([df5, df6]) #new column has null values very likely to have missing values

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [20]:
df7.fillna(0) #fill with 0

     A  B  C    D
1  2.0  0  0  0.0
2  1.0  9  9  0.0
3  0.0  0  9  8.0
4  0.0  7  4  8.0

In [23]:
df7.dropna(axis=0) #axis=1 drop columns

   B  C
1  0  0
2  9  9
3  0  9
4  7  4

### concat only if the two datasets have same columns 
### append and concat are similar
### may have duplicated index because they don't care about indexes

In [24]:
df5

   A  B  C
1  2  0  0
2  1  9  9

In [25]:
df6

   D  B  C
3  8  0  9
4  8  7  4

In [27]:
df5.append(df6) #may have duplicated index

/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:6692: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

     A  B  C    D
1  2.0  0  0  NaN
2  1.0  9  9  NaN
3  NaN  0  9  8.0
4  NaN  7  4  8.0

### merge

In [31]:
df1 = pd.DataFrame({"employed":["bob", "jake", "lisa", "sue"],
                   "group":["Accounting", "Engineering", "Engineering", "HR"]
                   }) 
#using dictionary to create dataframe
df2 = pd.DataFrame({"employed":["bob", "jake", "lisa", "sue"],
                   "hire_date":[2004, 2008, 2012, 2014]
                   }) 
df1.head()

  employed        group
0      bob   Accounting
1     jake  Engineering
2     lisa  Engineering
3      sue           HR

  employed        group  hire_date
0      bob   Accounting       2004
1     jake  Engineering       2008
2     lisa  Engineering       2012
3      sue           HR       2014

In [35]:
pd.merge(df1, df2, on="employed") #must clean dataframe first before merge. If not clean don't merge!

  employed        group  hire_date
0      bob   Accounting       2004
1     jake  Engineering       2008
2     lisa  Engineering       2012
3      sue           HR       2014

#can use pd.merge(df1, df2) if there is one common column

In [38]:
df3 = pd.DataFrame({"name":["bob", "jake", "lisa", "sue"],
                   "salary":[70000, 80000, 120000, 90000] })

In [39]:
df3 #rename the column for merge.... specify the key for each dataframe.

   name  salary
0   bob   70000
1  jake   80000
2  lisa  120000
3   sue   90000

In [46]:
df4 = pd.merge(df1, df3, left_on ="employed", right_on="name")
df4.drop("name", axis =1, inplace=True) #drop column with column as name

#inplace will replace original dataframe

## inner (intersection) and outer (union)

In [48]:
df6 = pd.DataFrame({"name":["Peter", "Paul", "Mary"],
                   "food":["fish","beans","bread"]
                   })
df7 = pd.DataFrame({"name":["Mary", "Joe"],
                   "drink":["wine","beer"]
                   })

In [49]:
df6 #intersection would just be mary only. common column if name the common value is mary. 
#Intersection merge would only be mary

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

In [50]:
df7

   name drink
0  Mary  wine
1   Joe  beer

In [52]:
pd.merge(df6, df7, on="name", how="inner")

   name   food drink
0  Mary  bread  wine

In [53]:
pd.merge(df6, df7, on="name", how="outer")

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine
3    Joe    NaN  beer

In [68]:
#5
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
df3 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
df4 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
merge1 = pd.merge(df1, df2, on="employee", how="outer")
merge2 = pd.merge(merge1,df4, left_on ="employee", right_on="name")
merge3 = pd.merge(merge2, df3, on="group", how= "outer") #many to one merge or one to many merge not many to many
df_complete = merge3.drop("name", axis = 1)
df_complete

#df_complete = merge3.drop("name", axis = 1, iplace = True)
df_complete = df_complete[["employee", "hire_date", "supervisor", "salary", "group"]]
df_complete

  employee  hire_date supervisor  salary        group
0      Bob       2008      Carly   70000   Accounting
1     Jake       2012      Guido   80000  Engineering
2     Lisa       2004      Guido  120000  Engineering
3      Sue       2014      Steve   90000           HR

### Aggregation, mean, max, min, percentile, median
## groupby

In [72]:
import seaborn as sns

planets = sns.load_dataset("planets")

planets.shape #how many columns(features, variables) sample size is 1035 (statistic), number of observation is 1035
#columns = features = dimensions

(1035, 6)

In [76]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [79]:
##summary statistics 
#doesn't show non- numerical data
planets.describe()

planets["method"].value_counts()

Radial Velocity                  553
Transit                          397
Imaging                           38
Microlensing                      23
Eclipse Timing Variations          9
Pulsar Timing                      5
Transit Timing Variations          4
Orbital Brightness Modulation      3
Astrometry                         2
Pulsation Timing Variations        1
Name: method, dtype: int64

In [81]:
planets.info() #not planets.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
method            1035 non-null object
number            1035 non-null int64
orbital_period    992 non-null float64
mass              513 non-null float64
distance          808 non-null float64
year              1035 non-null int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [82]:
planets.groupby("method") ["orbital_period"].median()
# group the df by methods
# the values show the median orbital_period

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [84]:
planets.groupby("method")["year"].describe()
#have to give function at the end for it to show something!

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

In [85]:
# create a column called decade, decade is the decade that the planet was discovered. 
decade = planets["year"]//10*10  #1985 198 *10 1980
decade = decade.astype(str) + "s"

In [90]:
type(decade)
# planets["decade"] = decade Don't need to add to dataframe

pandas.core.series.Series

In [88]:
planets.groupby(["method", decade])["number"].sum() #series has multiple index.. 

#each method how many planets are discovered in a given decade

method                         year
Astrometry                     2010s      2
Eclipse Timing Variations      2000s      5
                               2010s     10
Imaging                        2000s     29
                               2010s     21
Microlensing                   2000s     12
                               2010s     15
Orbital Brightness Modulation  2010s      5
Pulsar Timing                  1990s      9
                               2000s      1
                               2010s      1
Pulsation Timing Variations    2000s      1
Radial Velocity                1980s      1
                               1990s     52
                               2000s    475
                               2010s    424
Transit                        2000s     64
                               2010s    712
Transit Timing Variations      2010s      9
Name: number, dtype: int64

In [92]:
planets.groupby(["method", decade])["number"].sum().unstack().fillna(0) #dataframe!!! yay

year                           1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0

In [96]:
health = pd.read_csv("/Users/kevin/Downloads/AD 450/who.csv")
health_2 = health.drop(["iso2", "iso3"],axis =1)
health_2.columns

Index(['country', 'year', 'new_sp_m014', 'new_sp_m1524', 'new_sp_m2534',
       'new_sp_m3544', 'new_sp_m4554', 'new_sp_m5564', 'new_sp_m65',
       'new_sp_f014', 'new_sp_f1524', 'new_sp_f2534', 'new_sp_f3544',
       'new_sp_f4554', 'new_sp_f5564', 'new_sp_f65', 'new_sn_m014',
       'new_sn_m1524', 'new_sn_m2534', 'new_sn_m3544', 'new_sn_m4554',
       'new_sn_m5564', 'new_sn_m65', 'new_sn_f014', 'new_sn_f1524',
       'new_sn_f2534', 'new_sn_f3544', 'new_sn_f4554', 'new_sn_f5564',
       'new_sn_f65', 'new_ep_m014', 'new_ep_m1524', 'new_ep_m2534',
       'new_ep_m3544', 'new_ep_m4554', 'new_ep_m5564', 'new_ep_m65',
       'new_ep_f014', 'new_ep_f1524', 'new_ep_f2534', 'new_ep_f3544',
       'new_ep_f4554', 'new_ep_f5564', 'new_ep_f65', 'newrel_m014',
       'newrel_m1524', 'newrel_m2534', 'newrel_m3544', 'newrel_m4554',
       'newrel_m5564', 'newrel_m65', 'newrel_f014', 'newrel_f1524',
       'newrel_f2534', 'newrel_f3544', 'newrel_f4554', 'newrel_f5564',
       'newrel_f65'],
      dtype='object')

In [107]:
columns = []
for word in health_2.columns:
    if word[:6]!= "new_rel":
        columns.append(word)
    if word[:6]=="newrel":
        word ="new_rel" + word[6:]
        columns.append(word)

In [108]:
health_2.columns = columns
health_2.columns

Index(['country', 'year', 'new_sp_m014', 'new_sp_m1524', 'new_sp_m2534',
       'new_sp_m3544', 'new_sp_m4554', 'new_sp_m5564', 'new_sp_m65',
       'new_sp_f014', 'new_sp_f1524', 'new_sp_f2534', 'new_sp_f3544',
       'new_sp_f4554', 'new_sp_f5564', 'new_sp_f65', 'new_sn_m014',
       'new_sn_m1524', 'new_sn_m2534', 'new_sn_m3544', 'new_sn_m4554',
       'new_sn_m5564', 'new_sn_m65', 'new_sn_f014', 'new_sn_f1524',
       'new_sn_f2534', 'new_sn_f3544', 'new_sn_f4554', 'new_sn_f5564',
       'new_sn_f65', 'new_ep_m014', 'new_ep_m1524', 'new_ep_m2534',
       'new_ep_m3544', 'new_ep_m4554', 'new_ep_m5564', 'new_ep_m65',
       'new_ep_f014', 'new_ep_f1524', 'new_ep_f2534', 'new_ep_f3544',
       'new_ep_f4554', 'new_ep_f5564', 'new_ep_f65', 'new_rel_m014',
       'new_rel_m1524', 'new_rel_m2534', 'new_rel_m3544', 'new_rel_m4554',
       'new_rel_m5564', 'new_rel_m65', 'new_rel_f014', 'new_rel_f1524',
       'new_rel_f2534', 'new_rel_f3544', 'new_rel_f4554', 'new_rel_f5564',
       'new_rel_f65'],
      dtype='object')